//#include <iostream>
//using namespace std;
//
//
//int main() {
//
//	//数组
//
//	//1、数据类型  数组名[ 数组长度 ];
//	//2、数据类型  数组名[ 数组长度 ] = {值1，值2，值3....};
//	//3、数据类型  数组名[] = {值1，值2，值3....};
//
//	//1、数据类型  数组名[ 数组长度 ];
//	//int arr[3];
//	////给数组中的元素赋值
//	//arr[0] = 10;
//	//arr[1] = 20;
//	//arr[2] = 30;
//	////访问数据元素
//	//cout << arr[0] << endl;
//	//cout << arr[1] << endl;
//	//cout << arr[2] << endl;
//
//	//2、数据类型  数组名[ 数组长度 ] = {值1，值2，值3....};
//	//如果在初始化数据的时候，没有全部填写，会用0来填补剩余数据
//	//int arr[3] = { 10,20 };
//	//cout << arr[0] << endl;
//	//cout << arr[1] << endl;
//	//cout << arr[2] << endl;
//	////利用循环  输出数组中元素
//	//for (int i = 0; i < 3; i++) {
//	//	cout << arr[i] << endl;
//	//}
//	//3、数据类型  数组名[] = {值1，值2，值3....};
//	
//	int arr[] = {10,20,30,40};
//	for (int i = 0; i < 5; i++) {
//		cout << arr[i] << endl;
//	}
//
//	getchar();
//	return 0;
//}