//#include <iostream>
//using namespace std;
//
//
//int main() {
//
//	//二维数组定义方式
//	//1、数据类型  数组名 [ 行数 ][ 列数 ];
//	//2、数据类型  数组名 [ 行数 ][ 列数 ] = {{数据1，数据2},{数据3，数据4},{数据4，数据5}....}; 
//	//3、数据类型  数组名 [ 行数 ][ 列数 ] = {数据1，数据2,数据3，数据4,数据4，数据5....}; 
//	//4、数据类型  数组名 [  ][ 列数 ] = {数据1，数据2,数据3，数据4,数据4，数据5....}; 
//
//	//1、数据类型  数组名 [ 行数 ][ 列数 ];
//	int arr[2][3];
//	arr[0][0] = 1;
//	arr[0][1] = 2;
//	arr[0][2] = 3;
//	arr[1][0] = 4;
//	arr[1][1] = 5;
//	arr[1][2] = 6;
//	
//	//外层循环打印行数,内层循环打印列数
//	for (int i = 0; i < 2; i++) {
//		for (int j = 0; j < 3; j++) {
//			cout << arr[i][j] << " ";
//		}
//		cout << endl;
//	}
//	cout << endl;
//
//	//2、数据类型  数组名 [ 行数 ][ 列数 ] = {{数据1，数据2},{数据3，数据4},{数据4，数据5}....};
//
//	int arr2[2][3] = {
//		{1,2,3},
//		{4,5,6}
//	};
//	for (int i = 0; i < 2; i++) {
//		for (int j = 0; j < 3; j++) {
//			cout << arr2[i][j] << " ";
//		}
//		cout << endl;
//	}
//	cout << endl;
//
//	//3、数据类型  数组名 [ 行数 ][ 列数 ] = {数据1，数据2,数据3，数据4,数据4，数据5....};
//
//	int arr3[2][3] = { 12,2,5,6,4,8 };
//	for (int i = 0; i < 2; i++) {
//		for (int j = 0; j < 3; j++) {
//			cout << arr3[i][j] << " ";
//		}
//		cout << endl;
//	}
//	cout << endl;
//
//	//4、数据类型  数组名 [  ][ 列数 ] = {数据1，数据2,数据3，数据4,数据4，数据5....};
//
//	//未满的系统会补0；
//	int arr4[][3] = { 12,2,5,6,4,9,45,45,788,8,454 };
//	for (int i = 0; i < 4; i++) {
//		for (int j = 0; j < 3; j++) {
//			cout << arr4[i][j] << " ";
//		}
//		cout << endl;
//	}
//
//	getchar();
//	return 0;
//}